	// ind.cpp: определяет точку входа для консольного приложения.


	//						Індивідуальна робота		Зурілов І.		гр. 108		Варіант 9 


	#include "stdafx.h"
	#include <iostream>
	#include <cmath>
	#include <vector>
	#include <fstream>
	#include <cstring>
	#include "ind_.h" // Файл прототипів ф-цій


	using namespace std;


	int main()
	{
	/*
	Завдання 1 (головне)
	
	Скласти програму обчислення значень змінних за заданими розрахунковими формулами. 
	На екран вивести значення вхідних даних і результати обчислень, 
	супроводжуючи вивід найменуваннями виведених змінних.
	Кожну формулу реалізувати в окремій функції.

	--------------------

	Завдання 1.9
	Ввести з клавіатури цілі w, y та дійсні x, z, v. 
	Розрахувати А, В, С
	*/

	int w, y, alpha, beta;	// alpha, beta - градусна міра кутів для прикл. 3
	double x, z, v; 
	

	cout << "Ener firsts integer w, y, alpha and beta; then double x, z, v:" << endl;
	cin >> w >> y >> alpha >> beta >> x >> z >> v;


	cout << "A is " << exercise_1A(w, x, z, v) << endl; 
	cout << "B is " << exercise_1B(w, y, x, z, v) << endl;
	cout << "C is " << exercise_1C(alpha, beta) << endl;


	// ----------------------------------------------------


	/*
	Завдання 2 (головне)
	Обчислити значення функції Y за допомогою умовного оператора
	*/


	double a, b, x;

	cout << "Enter a, b and x :";
	cin >> a >> b >> x;

	cout << "Y is " << exercise_2(a, b, x) << endl;


	// ----------------------------------------------------


	/*
	Завдання 3 (головне)
	Описати статичний масив.
	Реалізувати 3 способи ініціалізації масиву (користувач має сам обрати спосіб, 
	зробити меню): 
	—	сформувати масив (n=20 елементів) за вказаним правилом;
	Визначити: (непарні варіанти)
	середньоарифметичне елементів масиву, мінімальне значення 
	масиву, його індекс
	—	ввести значення з клавіатури (виконати завдання за варіантом);
	—	заповнити масив псевдовипадковими числами (виконати завдання за варіантом).
	Результат записати до текстового файлу.

	--------------------

	9.	Масив дійсних чисел: A[i] = i^3 + 11*i - (i - 3)(i + 4) ; n = 20 (розмірність масиву)

	Визначити два сусідніх елементи масиву, сума яких 
	найбільш близька до числа R.

	*/


	int variant;
	double R;


	cout << "Firsts, enter R :";
	cin >> R;

	cout << "\nInput 1 - default , 2 - input elements by keyboard, 3 - random numbers : ";
	cin >> variant;

	switch (variant)
	{
	case 1: exercise_3(R); break;
	case 2: exercise_3_1(R); break;
	case 3: exercise_3_2(R); break;
	default: exercise_3(R); break;
	}


	// ----------------------------------------------------

	
	/*
	Завдання 4
	9.	Задано 2 текстових файли. Записати у третій файл тільки 
	ті рядки, які є і у першому і у другому файлах.
	*/


	void exercise_4();


	system("pause");

    return 0;
	}